Feature: Управление на крави
	Background: 
		Given Потребителят отваря екран за управление на крави

  Scenario: Успешно създаване на животно
    When Въвежда майка
    And Въвежда баща
    And Въвежда възраст
    And Въвежда пол
    And Въвежда ферма
  	And натиска бутон за създаване на животно
  	Then Получава съобщение "Успешно създаване на животно!"
  	
  Scenario: Успешно създаване на животно без майка
    When Въвежда баща
    And Въвежда възраст
    And Въвежда пол
    And Въвежда ферма
  	And натиска бутон за създаване на животно
  	Then Получава съобщение "Непълни данни!"
  	
  Scenario: Успешно създаване на животно без баща
    When Въвежда майка
    And Въвежда възраст
    And Въвежда пол
    And Въвежда ферма
  	And натиска бутон за създаване на животно
  	Then Получава съобщение "Непълни данни!"
  	
 Scenario: Успешно създаване на животно без възраст
    When Въвежда майка
    And Въвежда баща
    And Въвежда пол
    And Въвежда ферма
  	And натиска бутон за създаване на животно
  	Then Получава съобщение "Непълни данни!"
  	
  Scenario: Успешно създаване на животно без пол
    When Въвежда майка
    And Въвежда баща
    And Въвежда възраст
    And Въвежда ферма
  	And натиска бутон за създаване на животно
  	Then Получава съобщение "Непълни данни!"
  	
  Scenario: Успешно създаване на животно без ферма
    When Въвежда майка
    And Въвежда баща
    And Въвежда възраст
    And Въвежда пол
  	And натиска бутон за създаване на животно
  	Then Получава съобщение "Непълни данни!"
  	
  Scenario: Неуспешно чифтосване на животни от един и същи пол
  	When Въвежда пол на първи родител
  	And Въвежда пол на втори родител
  	And Натиска бутон за чифтосване
  	Then Получава съобщение "Неуспешно чифтосване, защото двете животни са от един и същи пол!"
  	
  Scenario: Неуспешно чифтосване при животни под две години
  	When Въвежда възраст на първи родител
  	And Въвежда възраст на втори родител
  	And Натиска бутон за чифтосване
  	Then Получава съобщение "Неуспешно чифтосване, защото майка и/или баща са под 2 години!"
  	
  Scenario: Неуспешно чифтосване при майки раждали преди по-малко от десет месеца
  	When Въвежда майка и месеци от последно раждане на майката
  	And Въвежда бащата
  	And Натиска бутон за чифтосване
  	Then Получава съобщение "Неуспешно чифтосване, защото майката е раждала преди по-малко от 10 месеца!"
  	
  Scenario: Успешно чифтосване на животни
  	When Въвежда майка, която е поне двегодишна и не е раждала в последните десет месеца
  	And Въвежда баща, който е поне двегодишен
  	And Натиска бутон за чифтосване
  	Then Получава съобщение "Успешно чифтосване на животни"